let curr;
let quiz = [
	{
		q: "바지걸이 뒤쪽을 확인하시오.",
		e: "손잡이에 적힌 다섯글자 회사이름을 쓰시오.",
		a: "유한킴벌리"
	},
	{
		q: "책장에 꽂힌 '미학오디세이 3'의 320페이지를 펼치시오.",
		e: "힌트는 재윤이에게 카카오톡으로 문의",
		a: "마고"
	},
	{
		q: "형이 준 예쁜 파카 주머니를 보시오.",
		e: "힌트는 재윤이에게 카카오톡으로 문의",
		a: "삼각김밥"
	},
	{
		q: "책상 위, 수지(ㅡ3ㅡ)와 이종석이 그려진 마우스패드를 들추어보시오",
		e: "힌트는 재윤이에게 카카오톡으로 문의",
		a: "띠뚜"
	},
	{
		q: "오늘 재윤이가 들은 수업 이름을 쓰시오",
		e: "띄어쓰기 없이 쓰시오",
		a: "자료구조"
	},
	{
		q: "재윤이에게 카카오톡으로 사랑한다고 말하시오",
		e: "재윤이가 답을 알려줄 것이오 ^0^",
		a: "나두"
	}
	{
		q: "문을 여시오",
		e: "천천히 여시오",
		a: "생일축하해"
	}
]

// init 
// 첫번째 퀴즈 보여주기
// curr 업데이트 후 cookie에 저장

// submit 누르면
// curr로 답체크

// 틀리면 틀림 표시

// 맞으면 curr 업데이트 후 cookie에 저장
// 그리고 다음 퀴즈 보여주기
// 그 전에 로딩 화면 보이도록


function updateCookie() {
}

function showQuiz() {
	
}

function showLoading() {
	
}
